pawelc06/STM32L100_Clock/STM32L100_Clock/src/Lcd_Driver.c
#include "stm32l1xx.h"
#include "Lcd_Driver.h"
#include "LCD_Config.h"
#include "delay.h"
#include "GUI.h"
#include <string.h>
#include "clock.h"

extern bool updateDate;


//  Pin2		CS
//	Pin3		SCL
//	Pin4		SDI
//	Pin5		RS
//	Pin6		RESET	
/***************************************************************/

/***************************************************************/
//łĚĐň˝ÓĎßËµĂ÷Łş
//#define LCD_CTRL   		GPIOB		//¶¨ŇĺTFTĘýľÝ¶ËżÚ
//#define LCD_CS        	GPIO_Pin_11 //MCU_PB11 ¶ÔÓ¦--->>TFT --PIN_CS
//#define LCD_SCL        	GPIO_Pin_12	//MCU_PB12 ¶ÔÓ¦--->>TFT --SCL
//#define LCD_SDA        	GPIO_Pin_13	//MCU_PB13 ¶ÔÓ¦--->>TFT --SDA
//#define LCD_RS         	GPIO_Pin_14	//MCU_PB14 ¶ÔÓ¦--->>TFT --RS
//#define LCD_RST     		GPIO_Pin_15	//MCU_PB15 ¶ÔÓ¦--->>TFT --RST
/***************************************************************/



//------------------------ioÄŁÄâspi˛ż·Ö---------------------------
// PB6-MOSI
#define SPIv_SetData(d) { if(d & 0x80) GPIO_SetBits(GPIOB,GPIO_Pin_15); else GPIO_ResetBits(GPIOB,GPIO_Pin_15);}
//PB7-MISO
#define SPIv_ReadData() GPIO_ReadInputDataBit(GPIOB,GPIO_Pin_14)
// PE0-SCK
#define SPIv_SetClk()	GPIO_SetBits(GPIOB,GPIO_Pin_13)
#define SPIv_ClrClk()	GPIO_ResetBits(GPIOB,GPIO_Pin_13)

volatile u8 mode = 0;
volatile u8 remoteClickedMode = 0;
volatile u8 remoteClickedUp = 0;
volatile u8 remoteClickedDown = 0;


//uint8_t Red, Green, Blue;
uint16_t Color;
uint16_t bkColor;

volatile uint16_t ssTogle;

//uint8_t Bk_red, Bk_green, Bk_blue;

volatile u16 last_hours, last_minutes, last_seconds;

volatile uint8_t last_year, last_month, last_day, last_weekday;


uint8_t Red, Green, Blue;
uint8_t Bk_red, Bk_green, Bk_blue;

void Set_color( uint8_t R, uint8_t G, uint8_t B  ) {
	uint32_t color24;

	color24 = (R << 16) | (G << 8) | B;
	Color = (uint16_t) LCD_RGB_24to16(color24);


}

void Set_bk_color( uint8_t R, uint8_t G, uint8_t B  ) {
	uint32_t color24;

		color24 = (R << 16) | (G << 8) | B;

		bkColor = (uint16_t) LCD_RGB_24to16(color24);
}

void Set_color32( uint32_t color ) {
	uint32_t color24;

	Red = (color>>16)&0xfe;
	Green = (color>>8)&0xfe;
	Blue = (color)&0xfe;

	color24 = (Red << 16) | (Green << 8) | Blue;
	Color = (uint16_t) LCD_RGB_24to16(color24);

}

void Set_bk_color32( uint32_t color ) {
	uint32_t color24;

	Bk_red = (color>>16)&0xfe;
	Bk_green = (color>>8)&0xfe;
	Bk_blue = (color)&0xfe;

	color24 = (Bk_red << 16) | (Bk_green << 8) | Bk_blue;
	bkColor = (uint16_t) LCD_RGB_24to16(color24);

}

void Draw_pixel() {

	//SPI_WriteByte(SPI2,(uint8_t)(Color>>8));
		//SPI_WriteByte(SPI2,(uint8_t)Color);



		Lcd_WriteData(Color>>8);
		Lcd_WriteData(Color);



}

void Draw_bk_pixel() {

	//SPI_WriteByte(SPI2,(uint8_t)(bkColor>>8));
	//SPI_WriteByte(SPI2,(uint8_t)bkColor);

	Lcd_WriteData(bkColor>>8);
	Lcd_WriteData(bkColor);
}



void tft_bitmap( int x, int y,  uint8_t * glyph, int width, int height  ) {

	uint32_t cred, cgreen, cblue;
	//uint16_t color;
	uint32_t color24;
		uint16_t idx=0;

		Lcd_SetRegion(x, y, x+width-1, y+height-1);

		while( idx < width*height*3 ) {
			cred =  glyph[ idx++ ] ;
			cgreen =  glyph[ idx++  ] ;
			cblue =  glyph[ idx++  ] ;

			color24 = (cred << 16) | (cgreen << 8) | cblue;
			//color = (uint16_t) LCD_RGB_24to16(color24);

			Set_color(cred, cgreen, cblue);
			Draw_pixel();
		}






}


u8 SPIv_WriteByte(u8 Byte)
{
	u8 i,Read;
	
	for(i=8; i; i--)
	{	
		SPIv_ClrClk();
		SPIv_SetData(Byte);	
		Byte<<=1;
		SPIv_SetClk();
		//Read <<= 1;
		//Read |= SPIv_ReadData();
	}
	//SPIv_ClrClk();
	return Read;
}


void SPIv_Init(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;
	

	 /*************************************/
	 /*!< SD_SPI_CS_GPIO, SD_SPI_MOSI_GPIO, SD_SPI_MISO_GPIO, SD_SPI_DETECT_GPIO
	       and SD_SPI_SCK_GPIO Periph clock enable */
	  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOB , ENABLE);

	  /*!< SD_SPI Periph clock enable */
	  //RCC_APB1PeriphClockCmd(RCC_APB1Periph_SPI2, ENABLE);


	  while(RCC_GetSYSCLKSource() != 0x0C);                //odczekaj az PLL bedzie sygnalem zegarowym systemu
	  	RCC_APB1PeriphClockCmd(RCC_APB1Periph_SPI2 , ENABLE);

	  /*!< Configure SD_SPI pins: SCK */
	  GPIO_InitStructure.GPIO_Pin = LCD_SCL;
	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_40MHz;
	  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	  GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_UP;
	  GPIO_Init(LCD_CTRL, &GPIO_InitStructure);

	  /*!< Configure SD_SPI pins: MISO */
	  GPIO_InitStructure.GPIO_Pin = LCD_SDO;
	  GPIO_Init(LCD_CTRL, &GPIO_InitStructure);

	  /*!< Configure SD_SPI pins: MOSI */
	  GPIO_InitStructure.GPIO_Pin = LCD_SDA;
	  GPIO_Init(LCD_CTRL, &GPIO_InitStructure);

	  /*!< Configure SD_SPI_CS_PIN pin: SD Card CS pin */
	  GPIO_InitStructure.GPIO_Pin = LCD_CS;
	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
	  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
	  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_40MHz;
	  GPIO_Init(LCD_CTRL, &GPIO_InitStructure);

	

}





void SPI_WriteByte(SPI_TypeDef* SPIx,u8 Byte)
{
	//while((SPIx->SR&SPI_I2S_FLAG_TXE)==RESET);
	SPIx->DR=Byte;
	//while((SPIx->SR&SPI_I2S_FLAG_RXNE)==RESET);
	//return SPIx->DR;

	//while (SPI_I2S_GetFlagStatus(SPIx, SPI_I2S_FLAG_TXE) == RESET);
	//  SPI_I2S_SendData(SPIx, Byte);

} 


void SPI_SetSpeed(SPI_TypeDef* SPIx,u8 SpeedSet)
{
	SPIx->CR1&=0XFFC7;
	if(SpeedSet==1)//¸ßËŮ
	{
		SPIx->CR1|=SPI_BaudRatePrescaler_8;//Fsck=Fpclk/2	
	}
	else//µÍËŮ
	{
		SPIx->CR1|=SPI_BaudRatePrescaler_32; //Fsck=Fpclk/32
	}
	SPIx->CR1|=1<<6; //SPIÉč±¸ĘąÄÜ
} 

void SPI2_Init(void)	
{

	SPI_InitTypeDef  SPI_InitStructure;

	GPIO_InitTypeDef GPIO_InitStructure;
	RCC->AHBENR |= RCC_AHBENR_GPIOBEN;
	    RCC->APB1ENR |= RCC_APB1ENR_SPI2EN;

	    // GPIOB - SCK, MISO, MOSI
		GPIOB->MODER |= GPIO_MODER_MODER13_1 | GPIO_MODER_MODER14_1 | GPIO_MODER_MODER15_1;
		GPIOB->OSPEEDR |= GPIO_OSPEEDER_OSPEEDR13 | GPIO_OSPEEDER_OSPEEDR14 | GPIO_OSPEEDER_OSPEEDR15;
		GPIOB->AFR[1] = 0x55500000;

