pawelc06/STM32L100_Clock/STM32L100_Clock/src/Lcd_Driver.c
		// GPIOB - PB12( CS )
		GPIOB->MODER |= GPIO_MODER_MODER12_0;
		GPIOB->OSPEEDR |= GPIO_OSPEEDER_OSPEEDR12;

		// init spi2
		RCC->APB1RSTR |= RCC_APB1RSTR_SPI2RST;
	    delay_ms( 15 );
	    RCC->APB1RSTR &= ~RCC_APB1RSTR_SPI2RST;
	 


	    SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
	    	SPI_InitStructure.SPI_Mode = SPI_Mode_Master;
	    	SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;
	    	SPI_InitStructure.SPI_CPOL = SPI_CPOL_High;
	    	SPI_InitStructure.SPI_CPHA = SPI_CPHA_2Edge;
	    	SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
	    	//SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_4; //8MHz
	    	SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_2; // 16MHz
	    	//SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_16; //500 kHz
	    	SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
	    	SPI_InitStructure.SPI_CRCPolynomial = 7;
	    	SPI_Init(SPI2, &SPI_InitStructure);


	    	SPI_Cmd(SPI2, ENABLE);



}


void Lcd_WriteIndex(u8 Index)
{
   u8 i=0;

   LCD_CS_CLR;
   LCD_RS_CLR;

   /*
   for (i = 0; i < 5; i++) {
   			__asm__("NOP");
   		}
*/


   SPI_WriteByte(SPI2,Index);
   
   LCD_CS_SET;
}


void Lcd_WriteData(u8 Data)
{
   u8 i=0;

   LCD_RS_SET;
   LCD_CS_CLR;

   /*
   for ( i = 0; i < 5; i++) {
   			__asm__("NOP");
   		}
*/

   //SPIv_WriteByte(Data);
   SPI_WriteByte(SPI2,Data);




   LCD_CS_SET;
}

void Lcd_WriteData16Bit(u8 DataH,u8 DataL)
{
	Lcd_WriteData(DataH);
	Lcd_WriteData(DataL);
}

void Lcd_WriteIndex16Bit(u8 DataH,u8 DataL)
{
	Lcd_WriteIndex(DataH);
	Lcd_WriteIndex(DataL);
}



void Lcd_Reset(void)
{
	LCD_RST_CLR;
	delay_ms(10);
	LCD_RST_SET;
	delay_ms(50);
}


void Lcd_Init(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;
	char TFTDriver=0;
	int i=0;

	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOB, ENABLE);
	//LCD_RST_CLR
	/*!< Configure SD_SPI_CS_PIN pin: SD Card CS pin */
		  GPIO_InitStructure.GPIO_Pin = LCD_RST;
		  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
		  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
		  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
		  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_40MHz;
		  GPIO_Init(LCD_CTRL, &GPIO_InitStructure);

		  	  	  GPIO_InitStructure.GPIO_Pin = LCD_CS;
		  		  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
		  		  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
		  		  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
		  		  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_40MHz;
		  		  GPIO_Init(LCD_CTRL, &GPIO_InitStructure);

		  		GPIO_InitStructure.GPIO_Pin = LCD_RS;
		  				  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
		  				  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
		  				  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
		  				  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_40MHz;
		  				  GPIO_Init(LCD_CTRL, &GPIO_InitStructure);

		  LCD_RST_SET;
		  LCD_CS_SET;
		  LCD_RS_SET;


	//SPIv_Init();
	SPI2_Init();
	Lcd_Reset();
	
	for(i=0;i<3;i++)
	    {
			//printf("Pętla: %d\r\n",i);
	        TFTDriver = readID();
	    }

	Lcd_WriteIndex(0xCB);  
        Lcd_WriteData(0x39); 
        Lcd_WriteData(0x2C); 
        Lcd_WriteData(0x00); 
        Lcd_WriteData(0x34); 
        Lcd_WriteData(0x02); 

        Lcd_WriteIndex(0xCF);  
        Lcd_WriteData(0x00); 
        Lcd_WriteData(0XC1); 
        Lcd_WriteData(0X30); 
 
        Lcd_WriteIndex(0xE8);  
        Lcd_WriteData(0x85); 
        Lcd_WriteData(0x00); 
        Lcd_WriteData(0x78); 
 
        Lcd_WriteIndex(0xEA);  
        Lcd_WriteData(0x00); 
        Lcd_WriteData(0x00); 
 
        Lcd_WriteIndex(0xED);  
        Lcd_WriteData(0x64); 
        Lcd_WriteData(0x03); 
        Lcd_WriteData(0X12); 
        Lcd_WriteData(0X81); 

        Lcd_WriteIndex(0xF7);  
        Lcd_WriteData(0x20); 
  
        Lcd_WriteIndex(0xC0);    //Power control 
        Lcd_WriteData(0x23);   //VRH[5:0] 
 
        Lcd_WriteIndex(0xC1);    //Power control 
        Lcd_WriteData(0x10);   //SAP[2:0];BT[3:0] 
 
        Lcd_WriteIndex(0xC5);    //VCM control 
        Lcd_WriteData(0x3e); //¶Ô±Č¶Čµ÷˝Ú
        Lcd_WriteData(0x28); 
 
        Lcd_WriteIndex(0xC7);    //VCM control2 
        Lcd_WriteData(0x86);  //--
 
        Lcd_WriteIndex(0x36);    // Memory Access Control 
        //Lcd_WriteData(0x48); //C8	   //48 68ĘúĆÁ//28 E8 şáĆÁ
        //Lcd_WriteData(MADCTL_MX | MADCTL_BGR);


        Lcd_WriteData(MADCTL_MX | MADCTL_MY | MADCTL_MV | MADCTL_BGR);

        //Lcd_WriteData(0x28);

        //Lcd_WriteData(0xE8);

        Lcd_WriteIndex(0x3A);    
        Lcd_WriteData(0x55); 

        Lcd_WriteIndex(0xB1);    
        Lcd_WriteData(0x00);  
        Lcd_WriteData(0x18); 
 
        Lcd_WriteIndex(0xB6);    // Display Function Control 
        Lcd_WriteData(0x08); 
        Lcd_WriteData(0x82);
        Lcd_WriteData(0x27);  
 
        Lcd_WriteIndex(0xF2);    // 3Gamma Function Disable 
        Lcd_WriteData(0x00); 
 
        Lcd_WriteIndex(0x26);    //Gamma curve selected 
        Lcd_WriteData(0x01); 
 
        Lcd_WriteIndex(0xE0);    //Set Gamma 
        Lcd_WriteData(0x0F); 
        Lcd_WriteData(0x31); 
        Lcd_WriteData(0x2B); 
        Lcd_WriteData(0x0C); 
        Lcd_WriteData(0x0E); 
        Lcd_WriteData(0x08); 
        Lcd_WriteData(0x4E); 
        Lcd_WriteData(0xF1); 
        Lcd_WriteData(0x37); 
        Lcd_WriteData(0x07); 
        Lcd_WriteData(0x10); 
        Lcd_WriteData(0x03); 
        Lcd_WriteData(0x0E); 
        Lcd_WriteData(0x09); 
        Lcd_WriteData(0x00); 

        Lcd_WriteIndex(0XE1);    //Set Gamma 
        Lcd_WriteData(0x00); 
        Lcd_WriteData(0x0E); 
        Lcd_WriteData(0x14); 
        Lcd_WriteData(0x03); 
        Lcd_WriteData(0x11); 
        Lcd_WriteData(0x07); 
        Lcd_WriteData(0x31); 
        Lcd_WriteData(0xC1); 
        Lcd_WriteData(0x48); 
        Lcd_WriteData(0x08); 
        Lcd_WriteData(0x0F); 
        Lcd_WriteData(0x0C); 
        Lcd_WriteData(0x31); 
        Lcd_WriteData(0x36); 
        Lcd_WriteData(0x0F); 
 
        Lcd_WriteIndex(0x11);    //Exit Sleep 
        delay_ms(120); 
				
