pawelc06/STM32L100_Clock/STM32L100_Clock/src/Lcd_Driver.c
        Lcd_WriteIndex(0x29);    //Display on 
        Lcd_WriteIndex(0x2c); 
#if 0
	//************* Start Initial Sequence **********//
	
	Lcd_WriteIndex16Bit(0x00,0x01);
	Lcd_WriteData16Bit(0x01,0x1C); // set SS and NL bit
	Lcd_WriteIndex16Bit(0x00,0x02);
	Lcd_WriteData16Bit(0x01,0x00); // set 1 line inversion
	Lcd_WriteIndex16Bit(0x00,0x03);
	Lcd_WriteData16Bit(0x10,0x30); // set GRAM write direction and BGR=1.//1030
	Lcd_WriteIndex16Bit(0x00,0x08);
	Lcd_WriteData16Bit(0x08,0x08); // set BP and FP
	Lcd_WriteIndex16Bit(0x00,0x0C);
	Lcd_WriteData16Bit(0x00,0x00); // RGB interface setting R0Ch=0x0110 for RGB 18Bit and R0Ch=0111for RGB16Bit
	Lcd_WriteIndex16Bit(0x00,0x0F);
	Lcd_WriteData16Bit(0x0b,0x01); // Set frame rate//0b01
	Lcd_WriteIndex16Bit(0x00,0x20);
	Lcd_WriteData16Bit(0x00,0x00); // Set GRAM Address
	Lcd_WriteIndex16Bit(0x00,0x21);
	Lcd_WriteData16Bit(0x00,0x00); // Set GRAM Address
	//*************Power On sequence ****************//
	delay_ms(50);                         // Delay 50ms
	Lcd_WriteIndex16Bit(0x00,0x10);
	Lcd_WriteData16Bit(0x0a,0x00); // Set SAP,DSTB,STB//0800
	Lcd_WriteIndex16Bit(0x00,0x11);
	Lcd_WriteData16Bit(0x10,0x38); // Set APON,PON,AON,VCI1EN,VC
	delay_ms(50);                  // Delay 50ms
	Lcd_WriteIndex16Bit(0x00,0x12);
	Lcd_WriteData16Bit(0x11,0x21); // Internal reference voltage= Vci;
	Lcd_WriteIndex16Bit(0x00,0x13);
	Lcd_WriteData16Bit(0x00,0x63); // Set GVDD
	Lcd_WriteIndex16Bit(0x00,0x14);
	Lcd_WriteData16Bit(0x4b,0x44); // Set VCOMH/VCOML voltage//3944
	//------------- Set GRAM area ------------------//
	Lcd_WriteIndex16Bit(0x00,0x30);
	Lcd_WriteData16Bit(0x00,0x00);
	Lcd_WriteIndex16Bit(0x00,0x31);
	Lcd_WriteData16Bit(0x00,0xDB);
	Lcd_WriteIndex16Bit(0x00,0x32);
	Lcd_WriteData16Bit(0x00,0x00);
	Lcd_WriteIndex16Bit(0x00,0x33);
	Lcd_WriteData16Bit(0x00,0x00);
	Lcd_WriteIndex16Bit(0x00,0x34);
	Lcd_WriteData16Bit(0x00,0xDB);
	Lcd_WriteIndex16Bit(0x00,0x35);
	Lcd_WriteData16Bit(0x00,0x00);
	Lcd_WriteIndex16Bit(0x00,0x36);
	Lcd_WriteData16Bit(0x00,0xAF);
	Lcd_WriteIndex16Bit(0x00,0x37);
	Lcd_WriteData16Bit(0x00,0x00);
	Lcd_WriteIndex16Bit(0x00,0x38);
	Lcd_WriteData16Bit(0x00,0xDB);
	Lcd_WriteIndex16Bit(0x00,0x39);
	Lcd_WriteData16Bit(0x00,0x00);
	// ----------- Adjust the Gamma Curve ----------//
	Lcd_WriteIndex16Bit(0x00,0x50);
	Lcd_WriteData16Bit(0x00,0x03);
	Lcd_WriteIndex16Bit(0x00,0x51);
	Lcd_WriteData16Bit(0x09,0x00);
	Lcd_WriteIndex16Bit(0x00,0x52);
	Lcd_WriteData16Bit(0x0d,0x05);
	Lcd_WriteIndex16Bit(0x00,0x53);
	Lcd_WriteData16Bit(0x09,0x00);
	Lcd_WriteIndex16Bit(0x00,0x54);
	Lcd_WriteData16Bit(0x04,0x07);
	Lcd_WriteIndex16Bit(0x00,0x55);
	Lcd_WriteData16Bit(0x05,0x02);
	Lcd_WriteIndex16Bit(0x00,0x56);
	Lcd_WriteData16Bit(0x00,0x00);
	Lcd_WriteIndex16Bit(0x00,0x57);
	Lcd_WriteData16Bit(0x00,0x05);
	Lcd_WriteIndex16Bit(0x00,0x58);
	Lcd_WriteData16Bit(0x17,0x00);
	Lcd_WriteIndex16Bit(0x00,0x59);
	Lcd_WriteData16Bit(0x00,0x1F);
	delay_ms(50);                    // Delay 50ms
	Lcd_WriteIndex16Bit(0x00,0x07);
	Lcd_WriteData16Bit(0x10,0x17);
	Lcd_WriteIndex16Bit(0x00,0x22);		
	delay_ms(200);
#endif

}

void Lcd_Init2(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;
	char TFTDriver=0;
	int i=0;

	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOB, ENABLE);
	//LCD_RST_CLR
	/*!< Configure SD_SPI_CS_PIN pin: SD Card CS pin */
		  GPIO_InitStructure.GPIO_Pin = LCD_RST;
		  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
		  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
		  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
		  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_40MHz;
		  GPIO_Init(LCD_CTRL, &GPIO_InitStructure);

		  	  	  GPIO_InitStructure.GPIO_Pin = LCD_CS;
		  		  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
		  		  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
		  		  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
		  		  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_40MHz;
		  		  GPIO_Init(LCD_CTRL, &GPIO_InitStructure);

		  		GPIO_InitStructure.GPIO_Pin = LCD_RS;
		  				  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
		  				  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
		  				  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
		  				  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_40MHz;
		  				  GPIO_Init(LCD_CTRL, &GPIO_InitStructure);

		  LCD_RST_SET;
		  LCD_CS_SET;
		  LCD_RS_SET;


	//SPIv_Init();
	SPI2_Init();
	Lcd_Reset();

	for(i=0;i<3;i++)
	    {
			//printf("Pętla: %d\r\n",i);
	        TFTDriver = readID();
	    }

	Lcd_WriteIndex(0xEF);
	  Lcd_WriteData(0x03);
	  Lcd_WriteData(0x80);
	  Lcd_WriteData(0x02);

	  Lcd_WriteIndex(0xCF);
	  Lcd_WriteData(0x00);
	  Lcd_WriteData(0XC1);
	  Lcd_WriteData(0X30);

	  Lcd_WriteIndex(0xED);
	  Lcd_WriteData(0x64);
	  Lcd_WriteData(0x03);
	  Lcd_WriteData(0X12);
	  Lcd_WriteData(0X81);

	  Lcd_WriteIndex(0xE8);
	  Lcd_WriteData(0x85);
	  Lcd_WriteData(0x00);
	  Lcd_WriteData(0x78);

	  Lcd_WriteIndex(0xCB);
	  Lcd_WriteData(0x39);
	  Lcd_WriteData(0x2C);
	  Lcd_WriteData(0x00);
	  Lcd_WriteData(0x34);
	  Lcd_WriteData(0x02);

	  Lcd_WriteIndex(0xF7);
	  Lcd_WriteData(0x20);

	  Lcd_WriteIndex(0xEA);
	  Lcd_WriteData(0x00);
	  Lcd_WriteData(0x00);

	  Lcd_WriteIndex(ILI9341_PWCTR1); //Power control
	  Lcd_WriteData(0x23); //VRH[5:0]

	  Lcd_WriteIndex(ILI9341_PWCTR2); //Power control
	  Lcd_WriteData(0x10); //SAP[2:0];BT[3:0]

	  Lcd_WriteIndex(ILI9341_VMCTR1); //VCM control
	  Lcd_WriteData(0x3e); //¶Ô±È¶Èµ÷½Ú
	  Lcd_WriteData(0x28);

	  Lcd_WriteIndex(ILI9341_VMCTR2); //VCM control2
	  Lcd_WriteData(0x86); //--

	  Lcd_WriteIndex(ILI9341_MADCTL); // Memory Access Control
	  //Lcd_WriteData(0x48);
	  Lcd_WriteData(MADCTL_MX | MADCTL_MY | MADCTL_MV | MADCTL_BGR);

	  Lcd_WriteIndex(ILI9341_PIXFMT);
	  Lcd_WriteData(0x55);



	  Lcd_WriteIndex(ILI9341_FRMCTR1);
	  Lcd_WriteData(0x00);
	  Lcd_WriteData(0x18);

	  Lcd_WriteIndex(ILI9341_DFUNCTR); // Display Function Control
	  Lcd_WriteData(0x08);
	  Lcd_WriteData(0x82);
	  Lcd_WriteData(0x27);






