pawelc06/STM32L100_Clock/STM32L100_Clock/src/Lcd_Driver.c
	  Lcd_WriteIndex(0xF2); // 3Gamma Function Disable
	  Lcd_WriteData(0x00);

	  Lcd_WriteIndex(ILI9341_GAMMASET); //Gamma curve selected
	  Lcd_WriteData(0x01);

	  Lcd_WriteIndex(ILI9341_GMCTRP1); //Set Gamma
	  Lcd_WriteData(0x0F);
	  Lcd_WriteData(0x31);
	  Lcd_WriteData(0x2B);
	  Lcd_WriteData(0x0C);
	  Lcd_WriteData(0x0E);
	  Lcd_WriteData(0x08);
	  Lcd_WriteData(0x4E);
	  Lcd_WriteData(0xF1);
	  Lcd_WriteData(0x37);
	  Lcd_WriteData(0x07);
	  Lcd_WriteData(0x10);
	  Lcd_WriteData(0x03);
	  Lcd_WriteData(0x0E);
	  Lcd_WriteData(0x09);
	  Lcd_WriteData(0x00);

	  Lcd_WriteIndex(ILI9341_GMCTRN1); //Set Gamma
	  Lcd_WriteData(0x00);
	  Lcd_WriteData(0x0E);
	  Lcd_WriteData(0x14);
	  Lcd_WriteData(0x03);
	  Lcd_WriteData(0x11);
	  Lcd_WriteData(0x07);
	  Lcd_WriteData(0x31);
	  Lcd_WriteData(0xC1);
	  Lcd_WriteData(0x48);
	  Lcd_WriteData(0x08);
	  Lcd_WriteData(0x0F);
	  Lcd_WriteData(0x0C);
	  Lcd_WriteData(0x31);
	  Lcd_WriteData(0x36);
	  Lcd_WriteData(0x0F);

	  Lcd_WriteIndex(ILI9341_SLPOUT); //Exit Sleep
	  delay_ms(120);
	  Lcd_WriteIndex(ILI9341_DISPON); //Display on


}


/*************************************************
şŻĘýĂűŁşLCD_Set_Region
ą¦ÄÜŁşÉčÖĂlcdĎÔĘľÇřÓňŁ¬ÔÚ´ËÇřÓňĐ´µăĘýľÝ×Ô¶Ż»»ĐĐ
ČëżÚ˛ÎĘýŁşxyĆđµăşÍÖŐµă,Y_IncMode±íĘľĎČ×ÔÔöyÔŮ×ÔÔöx
·µ»ŘÖµŁşÎŢ
*************************************************/
void Lcd_SetRegion(u16 x_start,u16 y_start,u16 x_end,u16 y_end)
{	
	Lcd_WriteIndex(0x2a); //column address set
	Lcd_WriteData16Bit(x_start>>8,x_start);
	Lcd_WriteIndex(0x2b); // page address set
	Lcd_WriteData16Bit(y_start>>8,y_start);
	Lcd_WriteIndex(0x2c); //memory write
	/*	
	Lcd_WriteIndex(0x50);
	Lcd_WriteData16Bit(x_start>>8,x_start);
	Lcd_WriteIndex(0x51);
	Lcd_WriteData16Bit(x_end>>8,x_end);

	Lcd_WriteIndex(0x52);
	Lcd_WriteData16Bit(y_start>>8,y_start);
	Lcd_WriteIndex(0x53);
	Lcd_WriteData16Bit(y_end>>8,y_end);


	Lcd_WriteIndex(0x22); */

}

void setAddrWindow(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1) {

	Lcd_WriteIndex(ILI9341_CASET); // Column addr set
	Lcd_WriteData(x0 >> 8);
	Lcd_WriteData(x0 & 0xFF); // XSTART
	Lcd_WriteData(x1 >> 8);
	Lcd_WriteData(x1 & 0xFF); // XEND

  Lcd_WriteIndex(ILI9341_PASET); // Row addr set
  Lcd_WriteData(y0>>8);
  Lcd_WriteData(y0); // YSTART
  Lcd_WriteData(y1>>8);
  Lcd_WriteData(y1); // YEND

  Lcd_WriteIndex(ILI9341_RAMWR); // write to RAM
}


void Lcd_SetXY(u16 x,u16 y)
{
  	Lcd_WriteIndex(0x2a);
	Lcd_WriteData16Bit(x>>8,x);
	Lcd_WriteIndex(0x2b);
	Lcd_WriteData16Bit(y>>8,y);

	Lcd_WriteIndex(0x2c);
}

	

void Gui_DrawPoint(u16 x,u16 y,u16 Data)
{
	Lcd_SetRegion(x,y,x,y);
	Lcd_WriteData(Data>>8);
	Lcd_WriteData(Data);

}    


unsigned int Lcd_ReadPoint(u16 x,u16 y)
{
  unsigned int Data=0;
  Lcd_SetXY(x,y);

  //Lcd_ReadData();//¶ŞµôÎŢÓĂ×Ö˝Ú
  //Data=Lcd_ReadData();
  Lcd_WriteData(Data);
  return Data;
}

void Lcd_Clear(u16 Color)               
{	
   unsigned int i,m;
   Lcd_SetRegion(0,0,X_MAX_PIXEL-1+200,Y_MAX_PIXEL-1+200);
   LCD_CS_CLR;
   //LCD_RS_SET;
   LCD_RS_SET;
   //SPIv_WriteByte(Data);

   
   for(i=0;i<Y_MAX_PIXEL+200;i++)
   {
    for(m=0;m<X_MAX_PIXEL+200;m++)
      {	 
	  	//SPIv_WriteByte(Color>>8);  
		//SPIv_WriteByte(Color);
		SPI_WriteByte(SPI2,Color>>8);
		SPI_WriteByte(SPI2,Color);
	  	//Lcd_WriteData16Bit(Color>>8,Color);
		//Lcd_WriteData(Color>>8);
		//Lcd_WriteData(Color);
      }   
	}
	 LCD_CS_SET;
}

void fillRect(int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color) {

		  // rudimentary clipping (drawChar w/big text requires this)
		  if((x >= X_MAX_PIXEL) || (y >= Y_MAX_PIXEL)) return;
		  if((x + w - 1) >= X_MAX_PIXEL) w = X_MAX_PIXEL - x;
		  if((y + h - 1) >= Y_MAX_PIXEL) h = Y_MAX_PIXEL - y;

		  setAddrWindow(x, y, x+w-1, y+h-1);

		  uint8_t hi = color >> 8, lo = color;

		  //*dcport |= dcpinmask;
		  //digitalWrite(_dc, HIGH);
		  //*csport &= ~cspinmask;
		  //digitalWrite(_cs, LOW);

		  LCD_CS_CLR;
		  LCD_RS_SET;

		  for(y=h; y>0; y--) {
		    for(x=w; x>0; x--) {
		    	SPI_WriteByte(SPI2,hi);
		    	SPI_WriteByte(SPI2,lo);
		    }
		  }
		  //digitalWrite(_cs, HIGH);
		  //*csport |= cspinmask;
		  LCD_CS_SET;
		}

void Lcd_Clear2(u16 Color)
{
	fillRect(0, 0,  X_MAX_PIXEL, Y_MAX_PIXEL, Color);
}

char readID(void)
{
    char i=0;
    uint8_t data[3] ;
    uint8_t ID[3] = {0x00, 0x93, 0x41};
    char ToF=1;
    for(i=0;i<3;i++)
    {
		//rintf("Read reg 1\r\n");
        data[i]=Read_Register(0xd3,i+1);
        if(data[i] != ID[i])
        {
            ToF=0;
        }
        //printf("Read reg 2\r\n");
    }
    if(!ToF) /* data!=ID */
    {
        //printf("\n\rRead TFT ID failed, ID should be 0x09341, but read ID = 0x");
        for(i=0;i<3;i++)
        {
            //printf("Dane : %d - %d " , i , data[i] );
        }
        //Serial.println();
    } else
		//printf("TFT Found\n\r");
    	;
    return ToF;
}

char Read_Register(char Addr, char xParameter)
{
    char data=0;
    uint8_t tt = 0;
    int i;
    //sendCMD(0xd9); /* ext command */
    Lcd_WriteIndex(0xd9);

    //WRITE_DATA(0x10+xParameter); /* 0x11 is the first Parameter */
    Lcd_WriteData(0x10+xParameter);

    //TFT_DC_LOW;
    LCD_RS_CLR;

    //TFT_CS_LOW;
    LCD_CS_CLR;

    for (i = 0; i < 5; i++) { /* Wait a bit. */
			__asm__("NOP");
		}
    //tt = spi_xfer(SPI2, Addr)

    //tt = SPI_WriteByte(SPI2, Addr);

		//while (!(SPI_SR(SPI2) & SPI_SR_RXNE));
    //TFT_DC_HIGH;
		LCD_RS_SET;

    for ( i = 0; i < 2; i++) { /* Wait a bit. */
			__asm__("NOP");
		}
    //tt =  SPI_DR(SPI2);
   // tt = SPI2->DR;

    tt = spi_readwrite(SPI2, 0);
    //tt = SPI_WriteByte(SPI2, 0);

    //TFT_CS_HIGH;
    LCD_CS_SET;

    return tt;
}

static uint8_t spi_readwrite(uint32_t spi, uint8_t data)
{
	//while (SPI_SR(spi) & SPI_SR_BSY);
	while (SPI2->SR & SPI_SR_BSY);

	//SPI_DR(spi) = data;
	SPI2->DR = data;

	while (!(SPI2->SR & SPI_SR_RXNE));
	return SPI2->DR;
}

/**
* Konwersja Int na String
* x = input integer, s = output buffer
*/
void itoa(uint16_t n, uint8_t s[]){
	int i, sign;
	if ((sign = n) < 0) /* record sign */
	n = -n; /* make n positive */
	i = 0;
	do { /* generate digits in reverse order */
		s[i++] = n % 10 + '0'; /* get next digit */
	} while ((n /= 10) > 0); /* delete it */

