pawelc06/STM32L100_Clock/STM32L100_Clock/src/Lcd_Driver.c
	if (sign < 0)
	s[i++] = '-';

	if(i<2)
		s[i++] = '0';

	/* ending of the string */
	s[i] = 0;
	reverse(s);
}

/**
* odwrócenie stringów
* s = string
*/
void reverse(int8_t s[])
{
int i, j;
char c;

for (i = 0, j = strlen(s)-1; i<j; i++, j--) {
		 c = s[i];
s[i] = s[j];
s[j] = c;
}
}

void LCD_Write_Colon(u16 xpos,u16 ypos){
	u16 short_break = 30;

	//colon
	//Gui_DrawFont_Num32(xpos,ypos,RED,GRAY0,11);
	tft_puts(xpos,ypos, ":", red, white);

	xpos = xpos+short_break;
}

void writeWeekDay(u16 xpos,u16 ypos,RTC_DateTypeDef  * RTC_DateStruct,uint16_t blink){

	if(!blink){
		tft_puts(xpos, ypos, "            ", white, black);

	} else {

	switch (RTC_DateStruct->RTC_WeekDay) {
	case 1:
			tft_puts(xpos, ypos, "poniedzialek", white, black);
			break;
		case 2:
			tft_puts(xpos, ypos, "wtorek      ", white, black);
			break;
		case 3:
			tft_puts(xpos, ypos, "sroda       ", white, black);
			break;
		case 4:
			tft_puts(xpos, ypos, "czwartek    ", white, black);
			break;
		case 5:
			tft_puts(xpos, ypos, "piatek      ", white, black);
			break;
		case 6:
			tft_puts(xpos, ypos, "sobota      ", white, black);
			break;
		case 7:
			tft_puts(xpos, ypos, "niedziela   ", white, black);
			break;
		default:
			tft_puts(xpos, ypos, "error       ", white, black);
			break;
	}
	}
}

void LCD_Write_Date(u16 xpos,u16 ypos,RTC_DateTypeDef  * RTC_DateStruct)
{
	uint8_t year, month, day, weekday;
	const u16 short_break = 22;
	uint8_t yearStr[5];
	uint8_t mStr[5];
	uint8_t dStr[5];

	uint8_t datas[9];
	u16 xposInit,blink;

	xposInit = xpos;

	year = RTC_DateStruct->RTC_Year;
	month = RTC_DateStruct->RTC_Month;
	day = RTC_DateStruct->RTC_Date;
	weekday = RTC_DateStruct->RTC_WeekDay;


	itoa((uint16_t) year + 2000, yearStr);
	itoa((uint16_t) month, mStr);
	itoa((uint16_t) day, dStr);

	setCurrentFont(&Verdana26ptFontInfo);
	//setCurrentFont( &DefaultFontInfo);

	blink = ((0x000F & ssTogle) % 2);

	switch (mode) {

	case 0:
	case 1:
	case 2:
		tft_puts(xpos, ypos, yearStr, white, black);
		xpos = xpos + 4 * short_break;

		tft_puts(xpos, ypos, "-", white, black);

		xpos = xpos + short_break;

		tft_puts(xpos, ypos, mStr, white, black);

		xpos = xpos + 2 * short_break;

		tft_puts(xpos, ypos, "-", white, black);

		xpos = xpos + short_break;

		tft_puts(xpos, ypos, dStr, white, black);

		ypos += 32;

		writeWeekDay(xposInit, ypos,RTC_DateStruct,1);

		break;

	case 3: //setting year

		if (blink) {
			tft_puts(xpos, ypos, yearStr, white, black);

		} else {
			tft_puts(xpos, ypos, "    ", white, black);
		}
		xpos = xpos + 4 * short_break;

		tft_puts(xpos, ypos, "-", white, black);

		xpos = xpos + short_break;

		tft_puts(xpos, ypos, mStr, white, black);

		xpos = xpos + 2 * short_break;

		tft_puts(xpos, ypos, "-", white, black);

		xpos = xpos + short_break;

		tft_puts(xpos, ypos, dStr, white, black);
		break;
	case 4: //setting month
		tft_puts(xpos, ypos, yearStr, white, black);
		xpos = xpos + 4 * short_break;



		tft_puts(xpos, ypos, "-", white, black);

		xpos = xpos + short_break;

		if (blink) {
			tft_puts(xpos, ypos, mStr, white, black);

		} else {
			tft_puts(xpos, ypos, "  ", white, black);
		}

		xpos = xpos + 2 * short_break;

		tft_puts(xpos, ypos, "-", white, black);

		xpos = xpos + short_break;

		tft_puts(xpos, ypos, dStr, white, black);
		break;
	case 5: //setting day
		tft_puts(xpos, ypos, yearStr, white, black);
		xpos = xpos + 4 * short_break;

		tft_puts(xpos, ypos, "-", white, black);

		xpos = xpos + short_break;

		tft_puts(xpos, ypos, mStr, white, black);

		xpos = xpos + 2 * short_break;

		tft_puts(xpos, ypos, "-", white, black);

		xpos = xpos + short_break;

		if (blink) {
			tft_puts(xpos, ypos, dStr, white, black);

		} else {
			tft_puts(xpos, ypos, "  ", white, black);
		}

		break;

	case 6: //setting weekday
		//tft_puts(xpos, ypos, yearStr, white, black);
				xpos = xpos + 4 * short_break;

				//tft_puts(xpos, ypos, "-", white, black);

				xpos = xpos + short_break;

				//tft_puts(xpos, ypos, mStr, white, black);

				xpos = xpos + 2 * short_break;

				//tft_puts(xpos, ypos, "-", white, black);

				xpos = xpos + short_break;

				//tft_puts(xpos, ypos, dStr, white, black);

				ypos += 32;

				writeWeekDay(xposInit, ypos,RTC_DateStruct,blink);

			break;
	default:
		break;

	}



}

void LCD_Write_TimeBCD2(u16 xpos,u16 ypos,RTC_TimeTypeDef * RTC_TimeStructure1)
{

	unsigned char datas[6];
	unsigned char datah[3];
	unsigned char datam[3];

	unsigned colon[2];

	uint8_t short_break = 47;

	u16 hh = 14;
	u16 mm = 33;
	u16 ss = 55;
	uint32_t color = white;
	uint32_t bkColor = black;
	uint8_t year, month, day, weekday;
	u16 blink;

	hh = RTC_TimeStructure1->RTC_Hours;
	mm = RTC_TimeStructure1->RTC_Minutes;
	ss = RTC_TimeStructure1->RTC_Seconds;



	blink = ((0x000F & ssTogle) % 2);







	//hours

	datah[0] = datas[0] = (hh >> 4) + 48;
	datah[1] = datas[1] = (0x000F & hh) + 48;

	datah[2] = 0;

	if (blink) {
		colon[0] = ':';
	} else {
		colon[0] = ' ';
	}

	colon[1] = 0;

	datam[0] = datas[3] = (mm >> 4) + 48;
	datam[1] = datas[4] = (0x000F & mm) + 48;
	datas[5] = 0;

	datam[2] = 0;

	setCurrentFont(&LetsgoDigital60ptFontInfo);

	switch (mode) {
	case 0:
		if (last_hours != hh){
			tft_puts(xpos, ypos, datah, color, bkColor);

			//if((last_hours == 23) && (hh==0))


		}

		xpos = xpos + 2 * short_break;
		//tft_puts(xpos, ypos, colon, color, bkColor);
		xpos = xpos + short_break;

		if (last_minutes != mm)
			tft_puts(xpos, ypos, datam, color, bkColor);

		last_hours = hh;
		last_minutes = mm;

		break;
	case 1:
		if (blink) {
			//Gui_DrawFont_Num32(xpos,ypos,RED,GRAY0,15);
			tft_puts(xpos, ypos, "  ", color, bkColor);

			xpos = xpos + 2 * short_break;

		} else {

			tft_puts(xpos, ypos, datah, color, bkColor);

			xpos = xpos + 2 * short_break;

