pawelc06/STM32L100_Clock/STM32L100_Clock/src/Lcd_Driver.c
		}

		//colon
		//tft_puts(xpos, ypos, colon, color, bkColor);

		xpos = xpos + short_break;
		tft_puts(xpos, ypos, datam, color, bkColor);
		break;
	case 2:
		tft_puts(xpos, ypos, datah, color, bkColor);

		xpos = xpos + 2 * short_break;
		//colon
		//tft_puts(xpos, ypos, colon, color, bkColor);

		xpos = xpos + short_break;
		if (blink) {


			tft_puts(xpos, ypos, "  ", color, bkColor);

		} else {


			tft_puts(xpos, ypos, datam, color, bkColor);



		}
		break;
	case 3:
	case 4:
	case 5:
	case 6:
		if (last_hours != hh){
					tft_puts(xpos, ypos, datah, color, bkColor);

					//if((last_hours == 23) && (hh==0))


				}

				xpos = xpos + 2 * short_break;

				//colon
				//tft_puts(xpos, ypos, colon, color, bkColor);
				xpos = xpos + short_break;

				if (last_minutes != mm)
					tft_puts(xpos, ypos, datam, color, bkColor);

				last_hours = hh;
				last_minutes = mm;


		displayDate();
		break;
	default:
		break;

	}


	if(!hh && !mm && !ss)
				updateDate = true;


}


void LCD_Write_TimeBCD_On_Background(u16 xpos,u16 ypos,RTC_TimeTypeDef * RTC_TimeStructure1)
{

	unsigned char datas[6];
	unsigned char datah[3];
	unsigned char datam[3];

	unsigned colon[2];

	uint8_t short_break=47;

	u16 hh=14;
	u16 mm=33;
	u16 ss=55;


	hh = RTC_TimeStructure1->RTC_Hours;
	mm = RTC_TimeStructure1->RTC_Minutes;
	ss = RTC_TimeStructure1->RTC_Seconds;

	//hours

	datah[0] = datas[0] = (hh >> 4)+48;
	datah[1] = datas[1] = (0x000F & hh)+48;

	datah[2] = 0;

	if(((0x000F & ss)%2)){
		colon[0] = ':';
	}	else {
		colon[0] = ' ';
	}

	colon[1] = 0;



	datam[0] = datas[3] = (mm >> 4)+48;
	datam[1] = datas[4] = (0x000F & mm)+48;
	datas[5] = 0;

	datam[2] = 0;


	           setCurrentFont( &LetsgoDigital60ptFontInfo );

	           if((mode == 1) && ((0x000F & ss)%2)){

	           				tft_puts_on_background(xpos,ypos, "  ", blue);


	           				xpos = xpos+2*short_break;

	           			} else {

	           				tft_puts_on_background(xpos,ypos, datah, blue);


	           				xpos = xpos+2*short_break;



	           			}

	           tft_puts_on_background(xpos,ypos, colon, blue);

	           xpos = xpos+short_break;

	           if((mode == 2) && ((0x000F & ss)%2)){

	           	           				tft_puts_on_background(xpos,ypos, "  ", blue);




	           	           			} else {

	           	           				tft_puts_on_background(xpos,ypos, datam, blue);




	           	           			}





}



void LCD_Write_TimeBCD(u16 xpos,u16 ypos,RTC_TimeTypeDef * RTC_TimeStructure1)
{

	unsigned char datas[6];


	u16 short_break = 30;
	u16 hh=14;
	u16 mm=33;
	u16 ss=55;


	hh = RTC_TimeStructure1->RTC_Hours;
	mm = RTC_TimeStructure1->RTC_Minutes;
	ss = RTC_TimeStructure1->RTC_Seconds;

	//hours

	datas[0] = (hh >> 4)+48;
	datas[1] = (0x000F & hh)+48;
	datas[2] = ':';
	datas[3] = (mm >> 4)+48;
	datas[4] = (0x000F & mm)+48;
	datas[5] = 0;

			mode = 0;

			if((mode == 1) && ((0x000F & ss)%2)){
				//Gui_DrawFont_Num32(xpos,ypos,RED,GRAY0,15);
				tft_puts(xpos,ypos, " ", red, white);

				xpos = xpos+short_break;

				//Gui_DrawFont_Num32(xpos,ypos,RED,GRAY0,15);
				tft_puts(xpos,ypos, " ", red, white);

				xpos = xpos+short_break;

			} else {
				//Gui_DrawFont_Num32(xpos,ypos,RED,GRAY0,datas[0]);
				tft_puts(xpos,ypos, datas, red, white);

				//xpos = xpos+short_break;

				//Gui_DrawFont_Num32(xpos,ypos,RED,GRAY0,datas[1]);
				//tft_puts(xpos,ypos, datas[1], red, white);
				xpos = xpos+short_break;



			}

				//colon
			    //Gui_DrawFont_Num32(xpos,ypos,RED,GRAY0,11);
				xpos = xpos+short_break;


					//minutes

				datas[0] = (mm >> 4);
				datas[1] = (0x000F & mm);

				if((mode == 2) && ((0x000F & ss)%2)){
					tft_puts(xpos,ypos, " ", red, white);

									xpos = xpos+short_break;

									//Gui_DrawFont_Num32(xpos,ypos,RED,GRAY0,15);
									tft_puts(xpos,ypos, " ", red, white);

									xpos = xpos+short_break;

								} else {
									//Gui_DrawFont_Num32(xpos,ypos,RED,GRAY0,datas[0]);
									tft_puts(xpos,ypos, 48+datas[0], red, white);

									xpos = xpos+short_break;

									//Gui_DrawFont_Num32(xpos,ypos,RED,GRAY0,datas[1]);
									tft_puts(xpos,ypos, 48+datas[1], red, white);
									xpos = xpos+short_break;


				}

				//colon
				//Gui_DrawFont_Num32(xpos,ypos,RED,GRAY0,11);
				xpos = xpos+short_break;

					//seconds

					datas[0] = (ss >> 4);
					datas[1] = (0x000F & ss);

					if((mode == 3) && ((0x000F & ss)%2)){
							Gui_DrawFont_Num32(xpos,ypos,RED,GRAY0,15);

							xpos = xpos+short_break;

							Gui_DrawFont_Num32(xpos,ypos,RED,GRAY0,15);

							xpos = xpos+short_break;

					} else {


							Gui_DrawFont_Num32(xpos,ypos,RED,GRAY0,datas[0]);
							xpos = xpos+short_break;

							Gui_DrawFont_Num32(xpos,ypos,RED,GRAY0,datas[1]);

					}
}

uint32_t LCD_RGB_24to16(uint32_t color)
{
uint32_t r, g, b, rgb;



rgb = ((color & 0xF80000)>>8) | ((color & 0xFC00)>>5) | ((color & 0xF8)>>3);

return( rgb );
}
